*Status - terraform apply: `success`
Merged by: @rm-ebex223*

<details><summary>Apply output</summary>

```

terraform
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sf-terraform-actions/gh-actions-dev/runs/run-JjWAs6TbrFjGNzDv

Waiting for the plan to start...

Terraform v1.9.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_database.demo_db will be created
  + resource "snowflake_database" "demo_db" {
      + catalog                                       = (known after apply)
      + comment                                       = "Database for Snowflake Terraform demo"
      + data_retention_time_in_days                   = (known after apply)
      + default_ddl_collation                         = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + id                                            = (known after apply)
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "DEMO_DB"
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
    }

  # snowflake_schema.demo_schema will be created
  + resource "snowflake_schema" "demo_schema" {
      + comment             = "Schema for Snowflake Terraform demo"
      + data_retention_days = -1
      + database            = "DEMO_DB"
      + id                  = (known after apply)
      + is_managed          = false
      + is_transient        = false
      + name                = "DEMO_SCHEMA"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on main.tf line 18, in provider "snowflake":
│   18: provider "snowflake" {
│ 
│ Specify the region as part of the account parameter
╵

snowflake_database.demo_db: Creating...
snowflake_database.demo_db: Creation complete after 1s [id=DEMO_DB]
snowflake_schema.demo_schema: Creating...
snowflake_schema.demo_schema: Creation complete after 0s [id=DEMO_DB|DEMO_SCHEMA]
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on main.tf line 18, in provider "snowflake":
│   18: provider "snowflake" {
│ 
│ Specify the region as part of the account parameter
╵

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.


```
  
</details>